routes/web.php

select * from `mobil` where `status_mobil` = 'tersedia' order by `created_at` desc limit 6
---
        if ($role === 'staff') return redirect('/staff/dashboard');
        return redirect('/login');
    }
    $mobilTersedia = Mobil::where('status_mobil', 'tersedia')->latest()->take(6)->get();