app/Http/Controllers/CustomerController.php

    public function index()
    {
        $customers = Customer::latest()->get();
---
select * from `customers` order by `created_at` desc