app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `mobil`
select count(*) as aggregate from `mobil` where `status_mobil` = 'tersedia'
select count(*) as aggregate from `customers`
select count(distinct `customer_id`) as aggregate from `verifikasi` where `status_verifikasi` = 'approve'
select count(*) as aggregate from `penyewaan`
select sum(`total_harga`) as aggregate from `penyewaan` where `status` in ('aktif', 'selesai')
select * from `penyewaan` where `status` = 'aktif' order by `created_at` desc limit 5
select * from `customers` order by `created_at` desc limit 6
---
    public function index()
    {
        $totalMobil = Mobil::count();
        $mobilTersedia = Mobil::where('status_mobil', 'tersedia')->count();
        $totalCustomer = Customer::count();
        $customerTerverifikasi = Verifikasi::where('status_verifikasi', 'approve')->distinct('customer_id')->count('customer_id');
        $totalPenyewaan = Penyewaan::count();
        $totalPendapatan = Penyewaan::whereIn('status', ['aktif', 'selesai'])->sum('total_harga');
        $penyewaanAktif = Penyewaan::where('status', 'aktif')->with('customer', 'mobil')->latest()->take(5)->get();
        $pelangganBaru = Customer::latest()->take(6)->get();