app/Http/Controllers/LaporanController.php

    public function index()
    {
        $totalPenyewaan = Penyewaan::count();
        $totalPendapatan = Penyewaan::where('status', 'selesai')->sum('total_harga');
        $totalMobil = Mobil::count();
        $totalCustomer = Customer::count();
---
select count(*) as aggregate from `penyewaan`
select sum(`total_harga`) as aggregate from `penyewaan` where `status` = 'selesai'
select count(*) as aggregate from `mobil`
select count(*) as aggregate from `customers`