app/Http/Controllers/MobilController.php

select * from `mobil` order by `created_at` desc
---
    public function index()
    {
        $mobils = Mobil::with('manager')->latest()->get();