app/Http/Controllers/PenyewaanController.php

    public function index()
    {
        $penyewaans = Penyewaan::with('customer', 'mobil', 'user')->latest()->paginate(15);
---
select * from `penyewaan` order by `created_at` desc