app/Http/Controllers/StaffController.php

    public function index()
    {
        $users = User::where('role', 'staff')->latest()->get();
---
select * from `users` where `role` = 'staff' order by `created_at` desc