app/Http/Controllers/VerifikasiController.php

select * from `verifikasi` order by `created_at` desc
---
    public function index()
    {
        $verifikasis = Verifikasi::with('customer', 'verifier')->latest()->get();